Revit 2027 API
FormatValueOptions.SetFormatOptions Method
 Sets the FormatOptions to optionally override the default settings in the Units class.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetFormatOptions(
	FormatOptions formatOptions
)
Public Sub SetFormatOptions (
	formatOptions As FormatOptions
)
public:
void SetFormatOptions(
	FormatOptions^ formatOptions
)
member SetFormatOptions :
        formatOptions : FormatOptions -> unit
Parameters
formatOptions FormatOptions
 The FormatOptions.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 By default, the FormatOptions represents default formatting (UseDefault is true) and the FormatOptions in the Units class will be used.
See Also
Reference
FormatValueOptions Class
Autodesk.Revit.DB Namespace